{
  "MENU": {
    "MENU_TITLE": "Desenvolvedor Web Santana",
    "JESUS_PHRASE": "é o caminho!"
  },
  "HOME": {
      "PAGE_TITLE": "INÍCIO",
      "TITLE": "OLÁ, SOU FREELANCER",
      "SUBTITLE": "Operando em São José dos Campos, SP - BR",
      "BUTTON_LABEL": "Ver Meus Trabalhos"
  },
  "ABOUT_ME": {
    "PAGE_TITLE": "Conheça me mais",
    "SOLUTATION": "Olá, sou",
    "FIRST_PARAGRAPH": "Atualmente trabalho como programador de sistemas de informação e possuo habilidades em desenvolvimento web, criando landing pages, páginas e websites, consumindo APIs e criando todo tipo de relatórios para sistemas educacionais.",
    "SECUND_PARAGRAPH": "Tenho habilidades em HTML, CSS, JavaScript, React.js, além de ferramentas como Visual Studio Code, Grape.js, Github, entre outras. Possuo conhecimento básico em tecnologias como TypeScript, MySQL, MongoDB, gerenciamento de pacotes NPM, Python, PHP, Cloud Computing AWS, NGINX, PM2 e outras para uso no backend. Tenho experiência anterior como estagiário no Tribunal de Contas da União (TCU), onde ajudei a desenvolver e manter aplicações web Oracle Express com o framework Apex.",
    "THIRD_PARAGRAPH": "Certificados em Desenvolvimento Web em PHP, WordPress Bootstrap 5, JavaScript, HTML5 e CSS3, Lógica de Programação Essencial, Arquitetura de Sistemas Avançados.",
    "FOURTH_PARAGRAPH": "Estou sempre em busca de oportunidades para aprimorar minhas habilidades e ampliar minha experiência na área de desenvolvimento web e/ou front-end, e estou aberto a novos desafios e oportunidades.",
    "FIVETH_PARAGRAPH": "Tenho mais de 20 anos de experiência no mercado de trabalho, tendo passado por outras áreas como varejo e transporte.",
    "YEARS": "Anos de",
    "EXPERIENCE": "Experiência",
    "NAME":"Nome:",
    "EMAIL":"E-mai:",
    "DATE_OF_BIRTH":"Data de nasc.:",
    "DATE":"07 de maio, 1984",
    "FROM":"De:"
  },
  "SERVICES": {
    "SERVICES_TITLE_HEADER": "Serviços",
    "SERVICES_TITLE_PAGE": "Como posso ajudar seu próximo projeto",
    "SERVICES_TITLE_CARD_ONE": "Desenvolvedor web",
    "SERVICES_TEXT_CARD_ONE": "Crio a interface visual e interativa de sites/aplicativos web. Utilizo HTML, CSS e JavaScript para visuais, estilos e interatividade, visando uma experiência atrativa, intuitiva e responsiva.",
    "SERVICES_TITLE_CARD_TWO": "Desenvolvedor de UI/UX",
    "SERVICES_TEXT_CARD_TWO": "Implemente designs com código funcional usando HTML, CSS e JavaScript. Crie elementos interativos para uma experiência de usuário intuitiva. Colaboro com designers para fidelidade de design e otimização de interface.",
    "SERVICES_TITLE_CARD_THREE": "Responsiva",
    "SERVICES_TEXT_CARD_THREE": "Meu objetivo é fornecer uma experiência consistente e amigável em todos os dispositivos. Isso inclui analisar os requisitos, criar layouts responsivos, codificar em HTML e CSS, testar em vários dispositivos e otimizar o desempenho. Esforço-me constantemente para melhorar a qualidade do projeto.",
    "SERVICES_TITLE_CARD_FOUR": "Navegabilidade",
    "SERVICES_TEXT_CARD_FOUR": "Criar uma navegação intuitiva e fácil de usar para os usuários, permitindo que eles encontrem facilmente o conteúdo que desejam.",
    "SERVICES_TITLE_CARD_FIVE": "Otimização de performance",
    "SERVICES_TEXT_CARD_FIVE": "Implemente práticas e técnicas para melhorar o desempenho do site, como carregamento rápido, redução de tamanho de arquivo e otimização de imagem.",
    "SERVICES_TITLE_CARD_SIX": "Acessibilidade",
    "SERVICES_TEXT_CARD_SIX": "Garantir a acessibilidade do site para todos os usuários, incluindo aqueles com deficiência. Siga as diretrizes para descrições de imagens, navegação pelo teclado e contraste para promover a inclusão."
  },
  "RESUME": {
    "TITLE_HEADER":"Currículo",
    "TITLE_PAGE": "Um resumo do meu currículo",
    "EDUCATION_TITLE": "Minha Educação",

    "FIRST_EDUCATION": "Análise e desenvolvimento de sistemas",
    "MANE_FIRST_SCHOOL": "Universidade Anhanguera | 07/2020 - 08/2022",
    "INFO_FIRST_SCHOOL": "Algoritmos e Programação Estruturada | Análise e Modelagem de Sistemas | Arquitetura e Organização de Computadores | Desenvolvimento Móvel | Cultura Digital | Pensamento de Design | Marketing Digital | Mentalidade Ágil | Engenharia de Software | Idiomas | Lógica Computacional | Modelagem de Dados | Programação e Desenvolvimento de Banco de Dados | Programação Web | Segurança e Auditoria de Sistemas | Sistemas operacionais | Sociedade Brasileira e Cidadania.",

    "SECUND_EDUCATION": "Linguagem de Programação Web (PHP)",
    "MANE_SECUND_SCHOOL": "DRM Educação  | 10/2022 - 11/2022",
    "INFO_SECUND_SCHOOL": "Compreender o ambiente e a estrutura básica da linguagem PHP | Sintaxe básica do PHP. | Tipos de dados em PHP. | Operadores em PHP.",

    "THREE_EDUCATION": "Webdesign em WordPress",
    "MANE_THREE_SCHOOL": "DRM Educação | 09/2022 - 10/2022",
    "INFO_THREE_SCHOOL": "A Web e seus Serviços | WordPress | Exportando um Tema | Adicionando serviços ao site.",

    "FOUR_EDUCATION": "JavaScript",
    "MANE_FOUR_SCHOOL": "Udemy | 06/2021 - 07/2021",
    "INFO_FOUR_SCHOOL": "Introdução ao Javascript, O que é Javascript, Sintaxe básica, Variáveis ​​e tipos de dados, Operadores e expressões, Estruturas de controle (Condições, Loops, Switch-case), Funções (Declaração, Parâmetros, Retorno), Arrays (Criação, Manipulação, Acessando elementos) , Objetos (Criação, Propriedades, Métodos), Manipulação de DOM (Interagindo com elementos HTML, Seleção, Manipulação de Conteúdo), Tratamento de Exceções (blocos try-catch, Throwing, Tratamento de Erros), AJAX e Pedidos Assíncronos (Introdução ao AJAX, pedidos HTTP, Manipulação de resposta), Introdução ao ES6 (Let e ​​const, Funções de seta, Literais de modelo), Introdução ao Node.js (Instalação e configuração, Módulos e requisitos, Manipulação de arquivos), Introdução a estruturas e bibliotecas (Exemplos de estruturas populares, Introdução a jQuery, Uso de bibliotecas externas), Melhores Práticas de Desenvolvimento (Organização de Código, Comentários, Depuração).",

    "EXPERIENCE_TITLE": "Minha Experiência",

    "FIRST_EXPERIENCE": "Programador de sistemas de informação",
    "FIRST_INSTITUTION": "DRM Educação | 05/2022 - Present",
    "FIRST_DESCRIPTION": "Desenvolvimento de sites responsivos, landing pages e páginas que se adaptam a diferentes tamanhos de tela utilizando HTML, CSS, JavaScript e Visual Studio Code, Instrução aos clientes no uso do framework Grape.js para desenvolvimento e manutenção de páginas, Colaboração com a equipe para priorizar tarefas e cumprir prazos estabelecidos, Criação de relatórios para instituições de ensino, Criação de animações e interações usando JavaScript, Recuperação de dados de APIs e APIs REST, Criação dinâmica de componentes e elementos com base nas informações obtidas de APIs, Validação de formulários usando JavaScript.",

    "SECUND_EXPERIENCE": "Estagiário",
    "SECUND_INSTITUTION": "Tribunal de Contas da União | 09/2021 - 11/2021",
    "SECUND_DESCRIPTION": "Colaborar no desenvolvimento de aplicações web utilizando a ferramenta Oracle Express com integração direta da ferramenta com o banco de dados PL/SQL, realizar manutenção e/ou criar novas funcionalidades no site interno da instituição de ensino do TCU, agregar melhorias aos projetos utilizando HTML, CSS e JavaScript quando necessário.",

    "THREE_EXPERIENCE": "Gerente de loja",
    "THREE_INSTITUTION": "Mercado Terra e Sol Eireli | 05/2019 - 12/2020",
    "THREE_DESCRIPTION": "Atuar como líder em todos os setores da loja (açougue, padaria, caixas, etc.), Implantação de padronização de processos (POP), Criação de promoções para fidelização de clientes, Atendimento ao cliente identificando suas necessidades, Planejamento para aumento do ticket médio , Preservar a ética nas relações comerciais com fornecedores e parceiros por meio da transparência nas informações e atitudes honestas, Interface com as demais áreas da empresa para estabelecer planos de ação a fim de atender as necessidades dos clientes e definir estratégias para alinhar as demandas comerciais, Acompanhar a evolução das vendas mensais, trimestrais , e faturamento semestral e desenvolvendo formas de mantê-lo crescendo, Realização de reuniões para apresentação de resultados mensais, Implementação de checklists, metas e acompanhamento de resultados.",

    "SKILL_TITLE": "Minhas Habilidades",
    "FIRST_SKILL_NAME": "Desenvolvedor Web",
    "RESUME_PT": "Baixar CV (PT)",
    "RESUME_EN": "Baixar CV (EN)"
  },
  "PORTFOLIO": {
    "PAGE_TITLE": "Alguns dos meus projetos mais recentes",
    "PROJECT_TITLE-0": "Meu Portfólio",
    "PROJECT_TITLE-1": "Meu aplicativo de portfólio",
    "PROJECT_TITLE-2": "API Rest",
    "PROJECT_TITLE-3": "Consumidor da API",
    "PROJECT_TITLE-4": "GolPag",
    "PROJECT_TITLE-5": "Template Clássico",
    "PROJECT_TITLE-6": "Template Oceano",
    "BUTTON": "Ver detalhes"
  },
  "DETAILS_PORTFOLIO": {
    "DESCRIPTION": "Descrição:",
    "LINK_PROJECT": "Ver Projeto",
    "LINK_GITHUB": "Ver GitHub",
    "DESCRIPTION-0": "Este projeto reflete minha experiência prática em implementação de design e interações interativas. Destaco minha criatividade através de páginas web com um estilo único, garantindo uma experiência cativante ao usuário. Este portfólio demonstra versatilidade com diversos projetos, incluindo websites e aplicações web. Estou ansioso para compartilhar meu trabalho e demonstrar como posso contribuir para o sucesso do seu projeto! Frameworks utilizados: Vite.js e React.js. Bibliotecas usadas: React-Router-Dom, React-scroll, Styled-Components, flag-icon-css, react-i18next.",
    "DESCRIPTION-1": "",
    "DESCRIPTION-2": "Essa API REST foi desenvolvida usando uma combinação de tecnologias e ferramentas de ponta, como Docker, Nginx e PM2. O React.js serviu como base para o desenvolvimento, fornecendo uma API robusta e flexível. O GitHub foi usado para controle eficiente do código-fonte, garantindo a integridade. A hospedagem foi feita na AWS, garantindo escalabilidade e confiabilidade. Essa combinação permitiu a criação de uma API REST de alto desempenho, escalonável e confiável para atender às necessidades do aplicativo.",
    "DESCRIPTION-3": "Este aplicativo foi desenvolvido usando React.js para consumir uma API Rest que criei. Simula um simples cadastro de usuários/funcionários em uma instituição de ensino, permitindo também o cadastro de alunos, incluindo foto e outras informações. O foco principal desta implementação foi a criação e consumo da API Rest, utilizando tecnologias como Nginx e PM2. Adicionalmente, foram utilizadas as seguintes tecnologias: React.js, Javascript, CSS, HTML. Para a construção da aplicação foram utilizadas as seguintes bibliotecas: Styled-Components, react-icons, history, axios, redux, lodash, validator, express-delay. Algumas das ferramentas usadas no desenvolvimento incluem: npm, Nginx, PM2.",
    "DESCRIPTION-4": "Desenvolvi uma landing page funcional e responsiva como parte do meu trabalho como desenvolvedor front-end. Utilizei tecnologias modernas como HTML5, CSS3 e JavaScript, implementando design responsivo para adaptar a página a diferentes dispositivos. Usei o Bootstrap para otimizar o desenvolvimento, fornecendo layouts flexíveis e uma experiência interativa. A página de destino destaca os recursos transparentes e poderosos do GOLPAG, com informações claras e design envolvente. Segui práticas de codificação organizadas, garantindo a manutenção do código. Tenho orgulho deste trabalho, utilizando habilidades front-end, incluindo HTML, CSS e JavaScript para criar interfaces funcionais e atraentes.",
    "DESCRIPTION-5": "Desenvolvi modelos de sites exclusivos para clientes da empresa usando HTML, CSS, JavaScript e Grape.js. Os templates consomem uma API customizada, trazendo informações específicas para cada cliente. Com o Grape.js, é fácil adicionar ou remover seções conforme necessário. Essa experiência fortaleceu minhas habilidades de front-end e aprimorou minha proficiência em Grape.js, permitindo-me criar soluções personalizadas e eficientes para atender às necessidades do cliente.",
    "DESCRIPTION-6": "Desenvolvi modelos de sites exclusivos para clientes da empresa usando HTML, CSS, JavaScript e Grape.js. Os templates consomem uma API customizada, trazendo informações específicas para cada cliente. Com o Grape.js, é fácil adicionar ou remover seções conforme necessário. Essa experiência fortaleceu minhas habilidades de front-end e aprimorou minha proficiência em Grape.js, permitindo-me criar soluções personalizadas e eficientes para atender às necessidades do cliente."
  },
  "REFERENCES": {
    "HEADER_TITLE":"Referências",
    "PAGE_TITLE":"Algumas Referências",
    "OFFICE_ONE":"Desenvolvedor Back End .NET",
    "TESTIMONY_ONE":"Tenho o prazer de recomendar Isaias como um talentoso Front End Developer. Durante nosso tempo de trabalho juntos, fiquei impressionado com suas habilidades técnicas e dedicação ao desenvolvimento front-end.Isaias demonstrou um profundo conhecimento em HTML, CSS e JavaScript, além de estar sempre atualizado com as tendências e melhores práticas da área. Sua capacidade de transformar designs em interfaces de usuário envolventes é notável.Além disso, Isaias é um colega de equipe colaborativo e comunicativo. Ele está sempre disposto a ajudar e contribuir para o sucesso dos projetos em que está envolvido.",
    "LAST-TEXT_ONE":"Atenciosamente, Abraão Henrique Vasconcelos",
    "OFFICE_TWO":"Gerente de logística",
    "TESTIMONY_TWO":"Recomendo o Isaías, pois trabalhamos em uma multinacional e o Isaías foi um profissional acima da média, buscando sempre conhecimento e solução de problemas, realmente uma pessoa determinada a contribuir no crescimento da Empresa e pessoal, portanto a Empresa que o contratar estará contratando uma pessoa que fará a diferença e sempre estará pronto a agregar ao time trabalhando com muita segurança e amor ao que faz.",
    "OFFICE_THREE":"Desenvolvedor Web Front-end ReactJS Pleno",
    "TESTIMONY_THREE":"Tive o prazer de poder acompanhar Isaías em sua carreira. Ele sem sombra de dúvidas tem muito a somar em qualquer time de desenvolvimento. Como algumas características desse profissional, se destacam suas habilidades de comunicação em equipe, a responsabilidade nas suas entregas, sua busca constante em se aprimorar em suas hard skills, a proatividade nas entregas das suas demandas, entre outras. Além das suas hard skills é um profissional diferenciado nas Soft skills, o que faz com que trabalhe muito bem integrado a qualquer time.",
    "OFFICE_FOUR":"Manicure... Operadora de Caixa na Concessionária das Rodovias Ayrton Senna e Carvalho Pinto S.A.",
    "TESTIMONY_FOUR":"O Isaias é dedicado e resiliente e não se deixa vencer pelas adversidades. O Isaias sempre tratou os clientes com simplicidade e empatia. Adicionalmente, possui qualidades enquanto pessoa, fundamentais em qualquer organização."
  }
}
