{
  "MENU": {
    "MENU_TITLE": "Desenvolvedor Web Santana",
    "JESUS_PHRASE": "é o caminho!"
},
  "HOME": {
      "PAGE_TITLE": "INÍCIO", 
      "TITLE": "OLÁ, SOU FREELANCER",
      "SUBTITLE": "Operando em São José dos Campos, SP - BR",
      "BUTTON_LABEL": "Ver Meus Trabalhos"
  },
  "ABOUT_ME": {
    "PAGE_TITLE": "Conheça me mais",
    "SOLUTATION": "Olá, sou",
    "FIRST_PARAGRAPH": "Atualmente trabalho como programador de sistemas de informação e possuo habilidades em desenvolvimento web, criando landing pages, páginas e websites, consumindo APIs e criando todo tipo de relatórios para sistemas educacionais.",
    "SECUND_PARAGRAPH": "Tenho habilidades em HTML, CSS, JavaScript, React.js, além de ferramentas como Visual Studio Code, Grape.js, Github, entre outras. Possuo conhecimento básico em tecnologias como TypeScript, MySQL, MongoDB, gerenciamento de pacotes NPM, Python, PHP, Cloud Computing AWS, NGINX, PM2 e outras para uso no backend. Tenho experiência anterior como estagiário no Tribunal de Contas da União (TCU), onde ajudei a desenvolver e manter aplicações web Oracle Express com o framework Apex.",
    "THIRD_PARAGRAPH": "Certificados em Desenvolvimento Web em PHP, WordPress Bootstrap 5, JavaScript, HTML5 e CSS3, Lógica de Programação Essencial, Arquitetura de Sistemas Avançados.",
    "FOURTH_PARAGRAPH": "Estou sempre em busca de oportunidades para aprimorar minhas habilidades e ampliar minha experiência na área de desenvolvimento web e/ou front-end, e estou aberto a novos desafios e oportunidades.",
    "FIVETH_PARAGRAPH": "Tenho mais de 20 anos de experiência no mercado de trabalho, tendo passado por outras áreas como varejo e transporte.",
    "YEARS": "Anos de",
    "EXPERIENCE": "Experiência",
    "NAME":"Nome:",
    "EMAIL":"E-mai:",
    "DATE_OF_BIRTH":"Data de nasc.:",
    "DATE":"07 de maio, 1984",
    "FROM":"De:"
  },
  "SERVICES": {
    "SERVICES_TITLE_HEADER": "Serviços",
    "SERVICES_TITLE_PAGE": "Como posso ajudar seu próximo projeto",
    "SERVICES_TITLE_CARD_ONE": "Desenvolvedor web",
    "SERVICES_TEXT_CARD_ONE": "Crio a interface visual e interativa de sites/aplicativos web. Utilizo HTML, CSS e JavaScript para visuais, estilos e interatividade, visando uma experiência atrativa, intuitiva e responsiva.",
    "SERVICES_TITLE_CARD_TWO": "Desenvolvedor de UI/UX",
    "SERVICES_TEXT_CARD_TWO": "Implemente designs com código funcional usando HTML, CSS e JavaScript. Crie elementos interativos para uma experiência de usuário intuitiva. Colaboro com designers para fidelidade de design e otimização de interface.",
    "SERVICES_TITLE_CARD_THREE": "Responsiva",
    "SERVICES_TEXT_CARD_THREE": "Meu objetivo é fornecer uma experiência consistente e amigável em todos os dispositivos. Isso inclui analisar os requisitos, criar layouts responsivos, codificar em HTML e CSS, testar em vários dispositivos e otimizar o desempenho. Esforço-me constantemente para melhorar a qualidade do projeto.",
    "SERVICES_TITLE_CARD_FOUR": "Navegabilidade",
    "SERVICES_TEXT_CARD_FOUR": "Criar uma navegação intuitiva e fácil de usar para os usuários, permitindo que eles encontrem facilmente o conteúdo que desejam.",
    "SERVICES_TITLE_CARD_FIVE": "Otimização de performance",
    "SERVICES_TEXT_CARD_FIVE": "Implemente práticas e técnicas para melhorar o desempenho do site, como carregamento rápido, redução de tamanho de arquivo e otimização de imagem.",
    "SERVICES_TITLE_CARD_SIX": "Acessibilidade",
    "SERVICES_TEXT_CARD_SIX": "Garantir a acessibilidade do site para todos os usuários, incluindo aqueles com deficiência. Siga as diretrizes para descrições de imagens, navegação pelo teclado e contraste para promover a inclusão."
  }
}